Autodesk.Revit.DB.MoveConstraintSettings.SetPlaneNorm(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.PlaneConstraintOptions)
Sets the plane constraint and the constraint options.
planeNorm:
The normal vector that defines the plane.
planeConstraintOption:
The plane constraint option.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid plane constraint arguments.
The plane normal must be a valid vector in case of custom plane constraint.
Otherwise, it should be a zero vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.MoveConstraintSettings.SetLineDir(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.LineConstraintOptions)
Sets the line constraint direction and the constraint behavior using one of the LineConstraintOptions.
lineDirection:
The line direction which defines the movement constraint.
lineConstraintOption:
The constraint behavior option.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid line constraint arguments.
The line direction must be a valid vector in case of custom line constraint.
Otherwise, it should be a zero vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.MoveConstraintSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.MoveConstraintSettings
Represents the options available to constrain the movement of picks.
Since:
2025